tests/load-tests/test0/register-login-analytics.yml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 30
      arrivalRate: 10 
scenarios:
  - flow:
      - post:
          url: "/auth/register"
          json:
            username: "test123"
            password: "test123"
      - post:
          url: "/auth/login"
          json:
            username: "test123"
            password: "test123"
      - get:
          url: "/analytics"